# Pratice Case Python

## Number 1

In [1]:
import sqlite3 as sl

In [2]:
def create_connection(db_file):
  conn = None
  try:
    conn = sl.connect(db_file)
    print('Connection Established')
    return conn
  except sl.Error as e:
    print(e)
  return conn

In [3]:
def create_insert(conn, q):
  try:
    c = conn.cursor()
    c.execute(q)
    print("Success!!")
    c.close()
  except sl.Error as e:
      print(e)

In [4]:
def select(conn, q):
    c = conn.cursor()
    c.execute(q)
    rows = c.fetchall()
    c.close()
    for row in rows:
        print(row)

In [5]:
create_transactions_table = """CREATE TABLE IF NOT EXISTS transactions(id UUID,
                                        insert_time TIMESTAMP NOT NULL,
                                        tx_amount FLOAT NOT NULL,
                                        tx_type CHARACTER(4) NOT NULL,
                                        status CHARACTER(6) NOT NULL
                                        )"""

In [6]:
insert_transactions_table = """INSERT INTO transactions(id, insert_time, tx_amount, tx_type, status) 
                           VALUES
                           (1,"2021-06-26 10:56:63", 1500, "buy","open"),
                           (2,"2021-06-26 10:57:63", 1508, "buy","open"),
                           (3,"2021-06-26 10:57:83", 1500, "sell","open"),
                           (1,"2021-06-26 10:57:83", 1500, "buy","close"),
                           (3,"2021-06-26 10:57:84", 1500, "sell","close"),
                           (4,"2021-06-26 10:58:04", 1508, "sell","open"),
                           (2,"2021-06-26 10:58:05", 1508, "buy","close"),
                           (4,"2021-06-26 10:58:05", 1508, "sell","close"),
                           (5,"2021-06-26 10:59:00", 1520, "sell","open"),
                           (6,"2021-06-26 10:59:04", 1515, "sell","open"),
                           (7,"2021-06-26 10:59:59", 1515, "sell","open");
                           """

In [7]:
db1 = create_connection(r'/content/drive/MyDrive/projectcase.db')

Connection Established

In [8]:
create_insert(db1, create_transactions_table)

Success!!

In [9]:
create_insert(db1, insert_transactions_table)

Success!!

In [10]:
select_all = "SELECT * FROM transactions"
select(db1, select_all)

(1, '2021-06-26 10:56:63', 1500.0, 'buy', 'open')
(2, '2021-06-26 10:57:63', 1508.0, 'buy', 'open')
(3, '2021-06-26 10:57:83', 1500.0, 'sell', 'open')
(1, '2021-06-26 10:57:83', 1500.0, 'buy', 'close')
(3, '2021-06-26 10:57:84', 1500.0, 'sell', 'close')
(4, '2021-06-26 10:58:04', 1508.0, 'sell', 'open')
(2, '2021-06-26 10:58:05', 1508.0, 'buy', 'close')
(4, '2021-06-26 10:58:05', 1508.0, 'sell', 'close')
(5, '2021-06-26 10:59:00', 1520.0, 'sell', 'open')
(6, '2021-06-26 10:59:04', 1515.0, 'sell', 'open')
(7, '2021-06-26 10:59:59', 1515.0, 'sell', 'open')

In [11]:
select_one = "SELECT id, MAX(insert_time), tx_amount, tx_type, status  FROM transactions GROUP BY id "
select(db1, select_one)

(1, '2021-06-26 10:57:83', 1500.0, 'buy', 'close')
(2, '2021-06-26 10:58:05', 1508.0, 'buy', 'close')
(3, '2021-06-26 10:57:84', 1500.0, 'sell', 'close')
(4, '2021-06-26 10:58:05', 1508.0, 'sell', 'close')
(5, '2021-06-26 10:59:00', 1520.0, 'sell', 'open')
(6, '2021-06-26 10:59:04', 1515.0, 'sell', 'open')
(7, '2021-06-26 10:59:59', 1515.0, 'sell', 'open')

## Number 2

In [12]:
create_sales_hist_table = "CREATE TABLE IF NOT EXISTS  sales_hist(date DATETIME, sales INT(10));"

In [13]:
insert_sales_hist_table = """INSERT INTO sales_hist(date, sales) 
                          VALUES
                          ("01/01/2021", 100),
                          ("02/01/2021", 34),
                          ("02/01/2021", 123),
                          ("02/01/2021", 134),
                          ("03/01/2021", 145),
                          ("03/01/2021", 24),
                          ("04/01/2021", 542),
                          ("04/01/2021", 636),
                          ("05/01/2021", 322),
                          ("06/01/2021", 242),
                          ("07/01/2021", 22),
                          ("08/01/2021", 46);"""

In [14]:
create_insert(db1, create_sales_hist_table)

Success!!

In [15]:
create_insert(db1, insert_sales_hist_table)

Success!!

In [16]:
select_all = "SELECT * FROM sales_hist"
select(db1, select_all)

('01/01/2021', 100)
('02/01/2021', 34)
('02/01/2021', 123)
('02/01/2021', 134)
('03/01/2021', 145)
('03/01/2021', 24)
('04/01/2021', 542)
('04/01/2021', 636)
('05/01/2021', 322)
('06/01/2021', 242)
('07/01/2021', 22)
('08/01/2021', 46)

In [17]:
select_two = "SELECT date, SUM(sales) FROM sales_hist GROUP BY date"
select(db1, select_two)

('01/01/2021', 100)
('02/01/2021', 291)
('03/01/2021', 169)
('04/01/2021', 1178)
('05/01/2021', 322)
('06/01/2021', 242)
('07/01/2021', 22)
('08/01/2021', 46)

In [18]:
db1.close()

## Number 3

In [19]:
import json
import pandas as pd

In [20]:
dataset = [
   {
       "user": {
           "id": 1,
           "name": "agus",
           "email": "agus@example.com"
       },
       "txs": [
           {
               "id": 1,
               "tx_date": "2020-01-01",
               "tx_amount": 10,
               "tx_type": "buy"
           },
           {
               "id": 3,
               "tx_date": "2020-02-01",
               "tx_amount": 10,
               "tx_type": "buy"
           },
           {
               "id": 5,
               "tx_date": "2020-03-01",
               "tx_amount": 20,
               "tx_type": "sell"
           }
       ]
   },
   {
       "user": {
           "id": 2,
           "name": "asep",
           "email": "asep@example.com"
       },
       "txs": [
           {
               "id": 2,
               "tx_date": "2020-01-01",
               "tx_amount": 10,
               "tx_type": "sell"
           },
           {
               "id": 4,
               "tx_date": "2020-02-01",
               "tx_amount": 10,
               "tx_type": "sell"
           },
           {
               "id": 6,
               "tx_date": "2020-03-01",
               "tx_amount": 20,
               "tx_type": "buy"
           }
       ]
   }
]

In [21]:
df = pd.json_normalize(dataset)

In [22]:
df

                                                 txs  ...        user.email
0  [{'id': 1, 'tx_date': '2020-01-01', 'tx_amount...  ...  agus@example.com
1  [{'id': 2, 'tx_date': '2020-01-01', 'tx_amount...  ...  asep@example.com

[2 rows x 4 columns]

In [23]:
df = pd.json_normalize(data=dataset, record_path='txs', meta=[['user','id'],['user','name'],['user','email']])

In [24]:
df

   id     tx_date  tx_amount tx_type user.id user.name        user.email
0   1  2020-01-01         10     buy       1      agus  agus@example.com
1   3  2020-02-01         10     buy       1      agus  agus@example.com
2   5  2020-03-01         20    sell       1      agus  agus@example.com
3   2  2020-01-01         10    sell       2      asep  asep@example.com
4   4  2020-02-01         10    sell       2      asep  asep@example.com
5   6  2020-03-01         20     buy       2      asep  asep@example.com

In [25]:
csv1 = df[['user.id','id']]
csv1

  user.id  id
0       1   1
1       1   3
2       1   5
3       2   2
4       2   4
5       2   6

In [26]:
csv2 = df[['user.id','user.name','user.email']]
csv2 = csv2.drop_duplicates()
csv2

  user.id user.name        user.email
0       1      agus  agus@example.com
3       2      asep  asep@example.com

In [27]:
csv3 = df[['id','tx_date','tx_amount','tx_type']]
csv3

   id     tx_date  tx_amount tx_type
0   1  2020-01-01         10     buy
1   3  2020-02-01         10     buy
2   5  2020-03-01         20    sell
3   2  2020-01-01         10    sell
4   4  2020-02-01         10    sell
5   6  2020-03-01         20     buy

In [28]:
csv1.to_csv('/content/drive/MyDrive/CSV1.csv',index=False)
csv2.to_csv('/content/drive/MyDrive/CSV2.csv',index=False)
csv3.to_csv('/content/drive/MyDrive/CSV3.csv',index=False)